recursos/xml/RespGenerarRetoProducto.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:v1="http://www.davivienda.com/RSA/SrvScnGeneracionProductoPCI/v1" xmlns:v11="http://www.davivienda.com/Esquemas/Framework/ContextoRespuestaTipo/v1" xmlns:v12="http://www.davivienda.com/Esquemas/Framework/ResultadoTransaccionTipo/v1" xmlns:v13="http://www.davivienda.com/Esquemas/Framework/ErrorTipo/v1" xmlns:v14="http://www.davivienda.com/Esquemas/Framework/PaginacionTipo/v1">
   <soapenv:Header/>
   <soapenv:Body>
      <v1:msjRespOpGenerarRetoProducto>
         <v1:contextoRespuesta>
            <v11:resultadoTransaccion>
               <v12:codEstadoTransaccion>?</v12:codEstadoTransaccion>
               <!--Optional:-->
               <v12:valCaracterAceptacion>?</v12:valCaracterAceptacion>
               <!--Optional:-->
               <v12:valNumeroAprobacion>?</v12:valNumeroAprobacion>
               <!--Optional:-->
               <v12:idTransaccion>?</v12:idTransaccion>
               <!--Optional:-->
               <v12:fecOperacion>?</v12:fecOperacion>
            </v11:resultadoTransaccion>
            <!--Optional:-->
            <v11:error>
               <v13:codMensajeRespuesta>?</v13:codMensajeRespuesta>
               <v13:valMensajeRespuesta>?</v13:valMensajeRespuesta>
               <!--Optional:-->
               <v13:codMensajeRespuestaBackend>?</v13:codMensajeRespuestaBackend>
               <!--Optional:-->
               <v13:valMensajeRespuestaBackend>?</v13:valMensajeRespuestaBackend>
            </v11:error>
            <!--Optional:-->
            <v11:paginacion>
               <!--Optional:-->
               <v14:valCantidadRegistrosLote>?</v14:valCantidadRegistrosLote>
               <!--Optional:-->
               <v14:valNumeroLote>?</v14:valNumeroLote>
               <!--Optional:-->
               <v14:valTotalRegistros>?</v14:valTotalRegistros>
            </v11:paginacion>
         </v1:contextoRespuesta>
         <!--Optional:-->
         <v1:producto>
            <v1:codigoTipoProducto>?</v1:codigoTipoProducto>
            <!--Optional:-->
            <v1:codigoSubProducto>?</v1:codigoSubProducto>
            <v1:valNombreProducto>?</v1:valNombreProducto>
         </v1:producto>
      </v1:msjRespOpGenerarRetoProducto>
   </soapenv:Body>
</soapenv:Envelope>